# St7GetBrickLighting

Returns the state of the Lighting options for brick rendering.

long St7GetBrickLighting(long uID, bool* FillLighting, bool* LineLighting)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
FillLighting
The lighting option for the brick fill; either True or False.
LineLighting
The lighting option for the brick outlines; either True or False.